/**************************************************************************************************
                                   版本所有(C), 2012-2013, 西安XXXXX公司
***************************************************************************************************
 文 件 名：CRealCOMPortMode.cpp
 版 本 号: 1.00初版
 作    者: HYF
 生成日期：2013－3－20
 最近修改:
 功能描述: RealCOM模式(Real COM工作模式)类实现文件
 函数列表:
 修改历史:
     1.日    期 : 2012-3-20
	   作    者 : HYF
	   修改内容 : 创建文件

**************************************************************************************************/

#include "stdafx.h"

CRealCOMPortMode::CRealCOMPortMode(void)
{

}


CRealCOMPortMode::~CRealCOMPortMode(void)
{

}
