/******************************************************************************

                  版权所有 (C), 2012-2022, 西安xxx信息科技有限公司

 ******************************************************************************
  文 件 名   : Tlv.h
  版 本 号   : 初稿
  作    者   : qzz
  生成日期   : 2013年3月19日
  最近修改   :
  功能描述   : tlv算法头文件
  函数列表   :
  修改历史   :
  1.日    期   : 2013年3月19日
    作    者   : qzz
    修改内容   : 创建文件

******************************************************************************/

/*----------------------------------------------*
 * 包含头文件                                   *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 外部变量说明                                 *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 外部函数原型说明                             *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 内部函数原型说明                             *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 全局变量                                     *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 模块级变量                                   *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 常量定义                                     *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 宏定义                                       *
 *----------------------------------------------*/


#pragma once


/* TLV结构 */
typedef struct TLVDATA
{
    ULONG ulType;
    ULONG ulLen;
    UCHAR aucValue[0];
          
}TLVDATA_STRU;



ULONG VOS_SetTlv(TLVDATA_STRU* pstTlvData, ULONG ulType, ULONG ulLen, VOID* pValue);
VOID VOS_SetTlvEndFlag(TLVDATA_STRU* pstTlvData);
UCHAR VOS_IsTlvEnd(TLVDATA_STRU* pstTlvData);
ULONG VOS_GetTlvValue(TLVDATA_STRU* pstTlvData, ULONG ulTlvLen, UCHAR* pucTlvValue);
TLVDATA_STRU* VOS_GetNextTlvAddr(TLVDATA_STRU* pstCurTlvDataAddr);
ULONG VOS_GetTlvValuebyType(TLVDATA_STRU* pstTlvData, ULONG ulType, UCHAR* pucTlvValue);
VOID* VOS_GetTlvAddrbyType(TLVDATA_STRU* pstTlvData, ULONG ulType);

